import pandas as pd
import numpy as np

# Имена учеников
students = ['Ученик 1', 'Ученик 2', 'Ученик 3', 'Ученик 4', 'Ученик 5',
            'Ученик 6', 'Ученик 7', 'Ученик 8', 'Ученик 9', 'Ученик 10']
# Предметы
subjects = ['Математика', 'Физика', 'Химия', 'Биология', 'Литература']
# Генерация случайных оценок от 2 до 5 для каждого ученика по каждому предмету
grades = np.random.randint(2, 6, size=(10, 5))
# Создание DataFrame
df = pd.DataFrame(grades, columns=subjects, index=students)

# Вывод DataFrame
print(df.head(4), '\n')

print(f'Средняя оценка по предмету "Математика" - {df["Математика"].mean()}')
print(f'Средняя оценка по предмету "Физика" - {df["Физика"].mean()}')
print(f'Средняя оценка по предмету "Химия" - {df["Химия"].mean()}')
print(f'Средняя оценка по предмету "Биология" - {df["Биология"].mean()}')
print(f'Средняя оценка по предмету "Литература" - {df["Литература"].mean()}', '\n')

print(f'Медианная оценка по предмету "Математика" - {df["Математика"].median()}')
print(f'Медианная оценка по предмету "Физика" - {df["Физика"].median()}')
print(f'Медианная оценка по предмету "Химия" - {df["Химия"].median()}')
print(f'Медианная оценка по предмету "Биология" - {df["Биология"].median()}')
print(f'Медианная оценка по предмету "Литература" - {df["Литература"].median()}', '\n')

Q1_math = df['Математика'].quantile(0.25) # Первый квартиль
Q3_math = df['Математика'].quantile(0.75) # Третий квартиль
IQR_ma = Q3_math - Q1_math # Межквартильный размах

print(f'Первый квартиль по предмету "Математика" - {Q1_math}')
print(f'Третий квартиль по предмету "Математика" - {Q3_math}')
print(f'Межквартильный размах по предмету "Математика" - {IQR_ma}', '\n')

print(f'Стандартное отклонение по предмету "Математика" - {df["Математика"].std()}')
print(f'Стандартное отклонение по предмету "Физика" - {df["Физика"].std()}')
print(f'Стандартное отклонение по предмету "Химия" - {df["Химия"].std()}')
print(f'Стандартное отклонение по предмету "Биология" - {df["Биология"].std()}')
print(f'Стандартное отклонение по предмету "Литература" - {df["Литература"].std()}', '\n')

